Revit 2026 API

# IFCDataSetSimpleType Method

---

Sets the corresponding IFC type by its name.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSimpleType(
	string typeName
)
```
```vb
Public Sub SetSimpleType (
	typeName As String
)
```
```cpp
public:
void SetSimpleType(
	String^ typeName
)
```
```fsharp
member SetSimpleType :
        typeName : string -> unit
```

#### Parameters

typeName String
     The name of the type.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace